cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "jcgay/jcgay"

brew "ag"
brew "apache-spark"
brew "apache-zeppelin"
brew "bat"
brew "cheat"
brew "clamav"
brew "clojure"
brew "ctop"
brew "curl"
brew "dep"
brew "diff-so-fancy"
brew "emacs"
brew "exa"
brew "fswatch"
brew "gist"
brew "git", args: ['without-completions']
brew "git-extras"
brew "go"
brew "gradle"
brew "groovy"
brew "haskell-stack"
brew "htop"
brew "httpie"
brew "httpstat"
brew "hub"
brew "hugo"
brew "jenv"
brew "leiningen"
brew "loc"
brew "lynx"
brew "m-cli"
brew "macvim", args: ['override-system-vim']
brew "mas"
brew "maven-deluxe"
brew "mycli"
brew "mysql"
brew "node"
brew "openssl"
brew "python"
brew "r"
brew "ripgrep"
brew "rmtrash"
brew "rust"
brew "rustup-init"
brew "sbt"
brew "scala"
brew "shellcheck"
brew "tig"
brew "tldr"
brew "travis"
brew "tree"
brew "typesafe-activator"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"

cask "alfred"
cask "atom"
cask "audacity"
cask "caffeine"
cask "calibre"
cask "chromium"
cask "cmake"
cask "disk-inventory-x"
cask "docker"
cask "etcher"
cask "firefox-beta"
cask "flash-player"
cask "gimp"
cask "gogland"
cask "google-chrome"
cask "grandperspective"
cask "haskell-platform"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "java6"
cask "java7"
cask "java8"
cask "keepingyouawake"
cask "kobo"
cask "lighttable"
cask "miniconda"
cask "ngrok"
cask "onyx"
cask "openoffice"
cask "p4merge"
cask "postman"
cask "rstudio"
cask "slack"
cask "soapui"
cask "spectacle"
cask "sublime-text"
cask "teamviewer"
cask "vagrant"
cask "visual-studio-code"
cask "virtualbox"
cask "vlc"
cask "xmind"

mas "Amphetamine", id: 937984704
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
