tap "atomicjar/tap"
tap "borkdude/brew"
tap "homebrew/cask"
tap "homebrew/core"
tap "jcgay/jcgay"
tap "tw93/tap"
tap "unhappychoice/tap"
brew "cargo-audit"
brew "cowsay"
brew "fzf"
brew "gh"
brew "gist"
brew "hugo"
brew "jq"
brew "libngtcp2"
brew "lstr"
brew "lychee"
brew "mas"
brew "mcfly"
brew "mise"
brew "node"
brew "podman"
brew "podman-compose", link: false
brew "tealdeer"
brew "the_silver_searcher"
brew "trash"
brew "uv"
brew "witr"
brew "yt-dlp"
brew "zola"
brew "borkdude/brew/clj-kondo"
brew "tw93/tap/mole"
brew "unhappychoice/tap/gitlogue"
cask "calibre"
cask "copilot-cli"
cask "ghostty"
cask "gimp"
cask "gitup-app"
cask "google-chrome"
cask "grandperspective"
cask "handy"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keepingyouawake"
cask "kobo"
cask "libreoffice"
cask "molotov"
cask "openemu"
cask "pinta"
cask "podman-desktop"
cask "postman"
cask "rectangle"
cask "slack"
cask "sublime-text"
cask "textmate"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "wezterm"
cask "xmind"
cask "zed"
mas "AdGuard Mini", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Sleep Alarm Clock", id: 1091149644
go "github.com/projectdiscovery/cvemap/cmd/cvemap"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/maaslalani/glyphs"
go "github.com/ramya-rao-a/go-outline"
go "github.com/acroca/go-symbols"
go "golang.org/dl/go1.20"
go "github.com/mdempsky/gocode"
go "github.com/stamblerre/gocode"
go "github.com/rogpeppe/godef"
go "golang.org/x/lint/golint"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/sqs/goreturns"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/savannahostrowski/gruyere"
go "golang.org/x/tools/cmd/guru"
go "github.com/maaslalani/nap"
go "github.com/irevenko/octotui"
go "github.com/jcgay/parallel-git-repo"
go "github.com/nicokosi/pullpigo"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/chenasraf/treelike"
go "github.com/maaslalani/typer"
cargo "cargo-generate"
cargo "gifski"
cargo "lobtui"
cargo "md-tui"
cargo "omaro"
cargo "presenterm"
cargo "pullpito"
cargo "relax-player"
cargo "rustlings"
cargo "sprofile"
uv "uv"
