cask_args appdir: "/Applications"

tap "cantino/mcfly"
tap "federico-terzi/espanso"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "jcgay/jcgay"
tap "wagoodman/dive"

brew "ag"
cask "adoptopenjdk8"
brew "apache-spark"
brew "bat"
brew "bitwarden-cli"
brew "broot"
brew "cheat"
brew "clojure"
brew "ctop"
brew "curl"
brew "dep"
brew "diff-so-fancy"
brew "ditaa"
brew "dive"
brew "emacs"
brew "espanso"
brew "exa"
brew "fd"
brew "fswatch"
brew "fzf"
brew "gist"
brew "git", args: ['without-completions']
brew "git-extras"
brew "git-gui"
brew "github/gh/gh"
brew "go"
brew "gradle"
brew "grip"
brew "groovy"
brew "htop"
brew "httpie"
brew "httpstat"
brew "hub"
brew "hugo"
brew "jenv"
brew "jq"
brew "leiningen"
brew "loc"
brew "lynx"
brew "m-cli"
brew "mcfly"
brew "macvim", args: ['override-system-vim']
brew "mas"
brew "maven-deluxe"
brew "mycli"
brew "mysql"
brew "netdata", restart_service: true
brew "node"
brew "nushell"
brew "openssl"
brew "python"
brew "ripgrep"
brew "rmtrash"
brew "sbt"
brew "scala"
brew "shellcheck"
brew "shfmt"
brew "tig"
brew "tldr"
brew "travis"
brew "tree"
brew "typesafe-activator"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"

cask "alfred3"
cask "caffeine"
cask "calibre"
cask "chromium"
cask "cmake"
cask "docker"
cask "etcher"
cask "firefox-beta"
cask "flash-player"
cask "gimp"
cask "google-chrome"
cask "grandperspective"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "keepingyouawake"
cask "kobo"
cask "lighttable"
cask "ngrok"
cask "onyx"
cask "openoffice"
cask "p4merge"
cask "postman"
cask "rectangle"
cask "slack"
cask "sublime-text"
cask "tad"
cask "teamviewer"
cask "vagrant"
cask "visual-studio-code"
cask "virtualbox"
cask "vlc"
cask "xmind"

mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
