cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/science'
tap 'jcgay/jcgay'

brew 'ag'
brew 'ctop'
brew 'curl'
brew 'diff-so-fancy'
brew 'docker'
brew 'docker-machine'
brew 'docker-machine-driver-xhyve'
brew 'emacs'
brew 'git'
brew 'go'
brew 'homebrew/science/r'
brew 'htop'
brew 'httpie'
brew 'httpstat'
brew 'jenv'
brew 'leiningen'
brew 'lynx'
brew 'maven-deluxe'
brew 'node'
brew 'openssl'
brew 'r-gui'
brew 'rmtrash'
brew 'sbt'
brew 'tig'
brew 'tree'
brew 'typesafe-activator'
brew 'wget'

cask 'alfred'
cask 'atom'
cask 'audacity'
cask 'caffeine'
cask 'calibre'
cask 'chromium'
cask 'disk-inventory-x'
cask 'firefox-beta'
cask 'flux'
cask 'gimp'
cask 'google-chrome'
cask 'haskell-platform'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'java'
cask 'java6'
cask 'java7'
cask 'kobo'
cask 'lighttable'
cask 'openoffice'
cask 'postman'
cask 'rstudio'
cask 'spectacle'
cask 'sublime-text'
cask 'teamviewer'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'xmind'
